app/helpers/notes_helper.rb

    def validate_note_id
        note_id = params[:id]
        if !note_id.nil?
            ### Si no llego nil, significa que no es el cajon global
            ### Verificamos si existe
            begin
                @note = Note.find(note_id)
---
SELECT `notes`.* FROM `notes` WHERE `notes`.`id` = 39 LIMIT 1