app/controllers/books_controller.rb

UPDATE `books` SET `books`.`title` = 'pepito', `books`.`updated_at` = '2020-12-20 22:14:46.744036' WHERE `books`.`id` = 1
---
    def update
        book_id = params[:id_book]
        @current_book = current_user.get_book(id: book_id)
        new_title =  params[:book][:title]
        if @current_book.update(title: new_title)