app/controllers/books_controller.rb

SELECT `books`.* FROM `books` WHERE `books`.`user_id` = 1 AND `books`.`id` IS NULL LIMIT 1
SELECT COUNT(*) FROM `books` WHERE `books`.`user_id` = 1
SELECT `books`.* FROM `books` WHERE `books`.`user_id` = 2 AND `books`.`id` = NULL LIMIT 11
---
    def index
        @books = current_user.books.page(params[:page])
        @total_pages = @books.page().total_pages

INSERT INTO `books` (`title`, `user_id`, `created_at`, `updated_at`) VALUES ('libro 1', 1, '2020-12-21 00:21:17.336039', '2020-12-21 00:21:17.336039')
---
    def create
        @book = Book.new(book_params)
        @book.user = current_user
        if @book.save

UPDATE `books` SET `books`.`title` = '13', `books`.`updated_at` = '2020-12-20 18:03:17.367948' WHERE `books`.`id` = 1
SELECT `books`.* FROM `books` WHERE `books`.`user_id` = 2 AND `books`.`id` = 1 LIMIT 1
---
    def update
        book_id = params[:id_book]
        if @book.update(book_params)
            flash[:notice] = "The book #{@book.title} has been updated succesfully"
            redirect_to action: 'index'
            return
        end
        # Como no pudo actualizarse pero el book cambia de todas formas, reseteamos el current book
        @current_book = current_user.books.find(book_id)

DELETE FROM `notes` WHERE `notes`.`book_id` = 12
DELETE FROM `books` WHERE `books`.`id` = 12
---
    def destroy
        if params[:id_book].to_i == 0
            # Borramos las notas del cuaderno global
            current_user.delete_global_notes()
            flash[:notice] = "The notes of global book has been deleted succesfully"
        else
            @book.destroy

SELECT `notes`.* FROM `notes` WHERE `notes`.`user_id` = 1
---
    def export
        id_book = params[:id_book]
        if id_book.nil?
            notes_to_export = current_user.global_notes()
            book_title = 'Global'
        else
            self.set_book()
            notes_to_export = @book.notes
            book_title = @book.title
        end

        if !notes_to_export.empty?

SELECT `books`.* FROM `books` WHERE `books`.`user_id` = 1 AND `books`.`id` = 300 LIMIT 1
SELECT `notes`.* FROM `notes` WHERE `notes`.`book_id` = 2
SELECT `notes`.* FROM `notes` WHERE `notes`.`user_id` = 1
---
    def export_all
        has_exported = false
        compiled_book = Zip::OutputStream.write_buffer do |zip_book|
            current_user.books.each do |book|
                if !book.notes.empty?
                    has_exported = true
                    zipped_content = export_helper(book.notes, 'html')
                    zip_book.put_next_entry("#{book.title}.zip")
                    zip_book << zipped_content.sysread
                end

            end
            if !current_user.global_notes.empty?