app/controllers/notes_controller.rb

    def index
        @id_book = params[:id_book]
        #@notes = current_user.get_notes_book(@id_book)
        @notes = current_user.get_notes_book(@id_book) .page(params[:page])
        @total_pages = @notes.page().total_pages
---
SELECT `books`.* FROM `books` WHERE `books`.`user_id` = 1 AND `books`.`id` IS NULL LIMIT 1
SELECT COUNT(*) FROM `notes` WHERE `notes`.`book_id` = 6
SELECT `notes`.* FROM `notes` WHERE `notes`.`user_id` = 2 LIMIT 11
SELECT `notes`.* FROM `notes` WHERE `notes`.`book_id` = 2 LIMIT 11

    def create
        title =  params[:note][:title]
        content =  params[:note][:content]
        book_id = params[:id_book]

        @note = Note.new(title: title, content: content, book_id: book_id, user_id: current_user.id)
        if @note.save
---
INSERT INTO `notes` (`title`, `content`, `book_id`, `created_at`, `updated_at`) VALUES ('Nota 1', 'Nota 1', 2, '2020-12-23 19:43:26.022340', '2020-12-23 19:43:26.022340')

    def edit
        note_id = params[:id]
        @current_note = Note.find(note_id)
---
SELECT `notes`.* FROM `notes` WHERE `notes`.`id` = 13 LIMIT 1

    def update
        note_id = params[:id]
        @current_note = Note.find(note_id)
        new_title = params[:note][:title]
        new_content = params[:note][:content]

        if @current_note.update(title: new_title,content: new_content)
            redirect_to action: 'index', id_book: @current_note.book_id
            return
        end

        ### Reinstanciamos la nota para editarla
        @note = Note.find(note_id)
---
SELECT `notes`.* FROM `notes` WHERE `notes`.`id` = 17 LIMIT 1
UPDATE `notes` SET `notes`.`title` = 'pepe2', `notes`.`updated_at` = '2020-12-29 20:07:56.669691' WHERE `notes`.`id` = 17
SELECT `notes`.* FROM `notes` WHERE `notes`.`id` = 29 LIMIT 1

    def destroy
        note_id = params[:id]
        note = Note.find(note_id)
        book_id = note.book_id
        note.destroy
---
SELECT `notes`.* FROM `notes` WHERE `notes`.`id` = 17 LIMIT 1
DELETE FROM `notes` WHERE `notes`.`id` = 17