app/models/note.rb

UPDATE `notes` SET `notes`.`exported_content` = '<p>ppa</p>\n', `notes`.`updated_at` = '2020-12-29 20:55:09.625248' WHERE `notes`.`id` = 29
---
    def export
        new_exported_content = Kramdown::Document.new(content).to_html
        self.exported_content = new_exported_content
        self.save()