app/models/user.rb

  def get_note(note_id)
    note = notes.find_by(id: note_id) ### Nos fijamos entre las notas del cuaderno global
    if note.nil?
      ### Si no esta en el global, buscamos entre los cuadernos creados por el usuario.

      ### Devuelve la instancia del cuaderno que tenga la nota. Si la nota no existe para ese usuario, retorna nil
      book = books.select { |book| book.has_note?(note_id)}[0]
---
SELECT `notes`.* FROM `notes` WHERE `notes`.`user_id` = 2 AND `notes`.`id` IS NULL LIMIT 1